; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v7 ?v11)
             (pred_1 ?v6 ?v3)
             (pred_9 ?v7 ?v3)
             (pred_8 ?v4 ?v7 )
	     (pred_2 ?v7)
             (pred_12 ?v8)
             (pred_10 ?v6)
             (pred_5 ?v3)
             (pred_3 ?v7)
             (pred_7 ?v6)
             (pred_11 ?v7)
             (pred_6 ))



(:action op_3
:parameters (?v1 ?v12 ?v2 ?v13)
:precondition (and (pred_12 ?v1) (pred_12 ?v12) (pred_10 ?v2) (pred_5 ?v13)
          (pred_4 ?v1 ?v12) (pred_1 ?v2 ?v13)
                   (pred_9 ?v12 ?v13) (pred_2 ?v1) 
                   (pred_3 ?v12) (pred_7 ?v2))
:effect (and  (pred_11 ?v12) (not (pred_3 ?v12))))


(:action op_1
:parameters (?v1 ?v5)
:precondition (and (pred_12 ?v1) (pred_12 ?v5)
               (pred_2 ?v1) (pred_4 ?v1 ?v5) (pred_11 ?v5))
:effect (and (pred_2 ?v5) (not (pred_2 ?v1))))

(:action op_2
:parameters (?v1 ?v2)
:precondition (and (pred_12 ?v1) (pred_10 ?v2) 
                  (pred_2 ?v1) (pred_8 ?v2 ?v1) (pred_6 ))
:effect (and (pred_7 ?v2)
   (not (pred_8 ?v2 ?v1)) (not (pred_6 ))))


(:action op_5
:parameters (?v1 ?v9 ?v10)
:precondition (and (pred_12 ?v1) (pred_10 ?v9) (pred_10 ?v10)
                  (pred_2 ?v1) (pred_7 ?v10) (pred_8 ?v9 ?v1))
:effect (and (pred_7 ?v9) (pred_8 ?v10 ?v1)
        (not (pred_7 ?v10)) (not (pred_8 ?v9 ?v1))))

(:action op_4
:parameters (?v1 ?v2)
:precondition (and (pred_12 ?v1) (pred_10 ?v2) 
                  (pred_2 ?v1) (pred_7 ?v2))
:effect (and (pred_6 ) (pred_8 ?v2 ?v1) (not (pred_7 ?v2)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_07 obj_06 obj_02 obj_01 obj_09 obj_12 obj_13 obj_03
    obj_08 obj_11
    obj_10 obj_05
    )

    (:init
       (pred_6)

       (pred_12 obj_04)
       (pred_12 obj_07)
       (pred_12 obj_06)
       (pred_12 obj_02)
       (pred_12 obj_01)
       (pred_12 obj_09)
       (pred_12 obj_12)
       (pred_12 obj_13)
       (pred_12 obj_03)
       (pred_5 obj_08)
       (pred_5 obj_11)
       (pred_10 obj_10)
       (pred_10 obj_05)

       (pred_4 obj_04 obj_02)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_07 obj_06)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_06 obj_09)
       (pred_4 obj_06 obj_07)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_02 obj_01)
       (pred_4 obj_02 obj_04)
       (pred_4 obj_01 obj_13)
       (pred_4 obj_01 obj_09)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_01 obj_02)
       (pred_4 obj_09 obj_03)
       (pred_4 obj_09 obj_06)
       (pred_4 obj_09 obj_01)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_13 obj_03)
       (pred_4 obj_13 obj_01)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_03 obj_09)
       (pred_4 obj_03 obj_13)
       (pred_3 obj_12)
       (pred_3 obj_02)
       (pred_9  obj_12 obj_08)
       (pred_9  obj_02 obj_11)
       (pred_11 obj_04)
       (pred_11 obj_07)
       (pred_11 obj_06)
       (pred_11 obj_01)
       (pred_11 obj_09)
       (pred_11 obj_13)
       (pred_11 obj_03)

       (pred_1  obj_10 obj_08)
       (pred_1  obj_05 obj_11)
       (pred_8 obj_10 obj_03)
       (pred_8 obj_05 obj_04)
       (pred_2 obj_13)
    )

    (:goal (and
       (pred_8 obj_05 obj_02)
    ))
(:constraints
  (always (not (pred_2 obj_01)))
)
)

; plan
1. (op_1 obj_13 obj_03)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_03)
   goals met: 0 of 1
2. (op_1 obj_03 obj_09)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_09)
   goals met: 0 of 1
3. (op_1 obj_09 obj_06)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_06)
   goals met: 0 of 1
4. (op_1 obj_06 obj_07)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_07)
   goals met: 0 of 1
5. (op_1 obj_07 obj_04)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_04)
   goals met: 0 of 1
6. (op_2 obj_04 obj_05)
   deleted: (pred_8 obj_05 obj_04) (pred_6)
   added: (pred_7 obj_05)
   goals met: 0 of 1
7. (op_3 obj_04 obj_02 obj_05 obj_11)
   deleted: (pred_3 obj_02)
   added: (pred_11 obj_02)
   goals met: 0 of 1
8. (op_1 obj_04 obj_02)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_02)
   goals met: 0 of 1
9. (op_4 obj_02 obj_05)
   deleted: (pred_7 obj_05)
   added: (pred_6) (pred_8 obj_05 obj_02)
   goals met: 1 of 1
